Kuon-Nakai/stm32learning/KeyIn/MDK-ARM/.pack/Keil/STM32G4xx_DFP.1.5.0/CMSIS/Driver/SPI_STM32G4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2021-2022 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        16. June 2022
 * $Revision:    V1.1
 *
 * Driver:       Driver_SPI1, Driver_SPI2, Driver_SPI3, Driver_SPI4
 *
 * Configured:   via CubeMX
 * Project:      SPI Driver for ST STM32G4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   SPI Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_SPI# = 1       use SPI1
 *   Connect to hardware via Driver_SPI# = 2       use SPI2
 *   Connect to hardware via Driver_SPI# = 3       use SPI3
 *   Connect to hardware via Driver_SPI# = 4       use SPI4
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.1
 *    Corrected Control function to support more than 16 data bits in DMA mode
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32g4_spi CMSIS-Driver SPI

\section stm32g4_spi_limitations Limitations

STM32 HAL limitations:
 - Number of items to send, receive or transmit is limited to 65535
 - Mode Fault and Data Lost events can be detected only when reception is active
 - Settings changes using Control function activate upon send/receive/transfer operation start

\note
If SPI driver is used in IRQ mode, ensure that it has higher priority then
any IRQ routine requiring longer processing time, because such IRQ routine
can prevent SPI IRQ routine to correctly handle reception thus fail to
receive all data correctly or fail to generate ARM_SPI_EVENT_TRANSFER_COMPLETE
event. Previous limitation can also be avoided by using SPI driver in DMA mode.

\section stm32g4_spi_setup STM32CubeMX Setup

The CMSIS-Driver SPI requires:
  - Setup of SPIx input clock
  - Setup of SPIx in Full-Duplex Master/Slave mode

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | NUCLEO-G474RE
:-------------------|:-------------
SPI Peripheral      | <b>SPI1</b>
SPI Mode            | Full-Duplex Master
NSS Pin             | PA4
SCK Pin             | PA5
MISO Pin            | PA6
MOSI Pin            | PA7

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for NUCLEO-G474RE with steps for Pinout, Clock, and
System Configuration are listed below. Enter the values that are marked \b bold.

Pinout view
-----------
  1. Configure SPI1 pins
    - PA4: SPI1_NSS
    - PA5: SPI1_SCK
    - PA6: SPI1_MISO
    - PA7: SPI1_MOSI

Pinout & Configuration tab
--------------------------
  1. Under <em>Connectivity</em> open \b SPI1:
    - Section <em>Mode</em>
      - Mode: <b>Full-Duplex Master</b>
      - Hardware NSS Signal: <b>Hardware NSS Output Signal</b>
    - Section <em>Configuration</em>
      - Parameter Settings: not used
      - User Constants: not used
      - NVIC Settings: configured later
      - DMA Settings: configured with DMA
      - GPIO Settings: check used pins

  2. Under <em>System Core</em> open \b GPIO:
    - <b>Group By Peripherals</b> - \b SPI:
         Pin Name | Signal on Pin | GPIO mode    | GPIO Pull-up/Pull..| Maximum out..| User Label
         :--------|:--------------|:-------------|:-------------------|:-------------|:----------
         PA4      | SPI1_NSS      | Alternate F..| No pull-up and no..| Very High    |.
         PA5      | SPI1_SCK      | Alternate F..| No pull-up and no..| Very High    |.
         PA6      | SPI1_MISO     | Alternate F..| No pull-up and no..| Very High    |.
         PA7      | SPI1_MOSI     | Alternate F..| No pull-up and no..| Very High    |.

  3. Under <em>System Core</em> open \b DMA:
    - Section <em>Configuration</em>
      - <b>DMA1, DMA2</b>
        - Click on \b Add button and add requests as in table below:
          DMA Request | Channel        | Direction            | Priority
          :-----------|:---------------|:---------------------|:--------
          SPI1_RX     | DMA1 Channel 1 | Peripheral to Memory | Low
          SPI1_TX     | DMA1 Channel 2 | Memory to Peripheral | Low

  4. Under <em>System Core</em> open \b NVIC:
    - Section <em>Configuration</em>
      - <b>NVIC</b>
           NVIC Interrupt Table                 | Enabled | Preemption Priority | Sub Priority
           :------------------------------------|:--------|:--------------------|:------------
           DMA1 channel1 global interrupt       |\b ON    | 0                   | 0
           DMA1 channel2 global interrupt       |\b ON    | 0                   | 0
           SPI1 global interrupt                |\b ON    | 0                   | 0

Clock Configuration tab
-----------------------
  1. Configure SPI1 Clock.

Project Manager tab
-------------------
  1. Open <b>Advanced Settings</b>:
     - enable <b>Do Not Generate Function Call</b> for MX_SPI1_Init.

\section stm32g4_spi_dv Validation

Results of the CMSIS-Driver Validation for this driver can be found in the [SPI_TestReport.txt](../../../CMSIS/Driver/Validation/SPI_TestReport.txt) file.
*/
/*! \cond */

#include "SPI_STM32G4xx.h"

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,1)

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SPI_API_VERSION, ARM_SPI_DRV_VERSION };

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  1,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1   /* Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT */
#if (defined(ARM_SPI_API_VERSION) && (ARM_SPI_API_VERSION >= 0x202U))
, 0U  /* Reserved bits */
#endif
};

static ARM_SPI_CAPABILITIES SPIX_GetCapabilities (void);
static int32_t              SPI_Initialize       (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi);
static int32_t              SPI_Uninitialize     (const SPI_RESOURCES *spi);
static int32_t              SPI_PowerControl     (ARM_POWER_STATE state, const SPI_RESOURCES *spi);
static int32_t              SPI_Send             (const void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Receive          (void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Transfer         (const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi);
static uint32_t             SPI_GetDataCount     (const SPI_RESOURCES *spi);
static int32_t              SPI_Control          (uint32_t control, uint32_t arg, const SPI_RESOURCES *spi);
static ARM_SPI_STATUS       SPI_GetStatus        (const SPI_RESOURCES *spi);

// SPI1
#ifdef MX_SPI1
#ifdef  MX_SPI1_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(1);
#endif
SPIx_RESOURCE_ALLOC(1);
#endif

